{
    "county": "Homabay",
    "clans": [
      {
        "name": "Karachuonyo",
        "description": "These are Joka Jok folks. Rachuonyo was the son of Jok. Sons of Jok were Chwanya Junior, Wanjare (Nyasgenga), Omwa, and Rachuonyo. Wanjare speared and killed Jok. Chwanya Junior was cared for by Waondo, Omwa and Owidi went to Kisumo, Nyasgenga settled among the Gusii becoming Wanjare. Rachuonyo was trained by Chien and given a dog named Sipul. Wives of Rachuonyo include Omieri (from Chien), Owaga Nyaluo, Achieng' Nyajuok, Auma Nyagoro, Aduet Nyarmaragoli, Adero Nyalang'o (Nyipir), and Achieng' Nyakila. Sons from these wives formed various sub-clans including Kangech, Kowuor, Kamenya, Kobila, Komwoyo, Kanjira, Kanam, Kakoth, Kakdhimu, Konyango, Kawadhgone, Koyugi, Kobuya, Kanyadhiang’, Kakwajuok, Kogweno, Kamiser, Kolonde, Karabondi, Kosano, Kajieyi, Kamuga, and Kanyipir."
      },
      {
        "name": "Kasipul",
        "description": "Another Joka Jok group. Sipul was son of Rachuonyo and Omieri, the wife inherited from Chien. Sipul bore Owidi who had four sons: Omala, Okoth, Anyango, and Okal. Okoth had three sons: Ojwach, Ndaya, and Ogudi. Ndaya had two sons: Onuong'a and Okwanyo. Onuong'a begat Odera Onyango Otieno, and Okwanyo begat Achieng', Muma, Magak, and Agola. Onuong'a also married Akelo, bearing Basa, the forefather of the Kakelo people. Clans include Katieno, Kodera, Kanyango, Kokal, Kogudi, Kachien, Kojwach, Kakelo, and Kokwanyo. The Konya group comprises Kachien, Kamuma, Kamagak, and Kagola."
      },
      {
        "name": "Kanyada",
        "description": "Joka'Omolo group tracing origins back to Alego. Nyada lived at 'Bungu Oburu' with brother Ragak/Kan. Descendants spread across South Nyanza. Nyada's son Omol Mbui led them to Nyilima in Asembo, fathering Othidha Dichol and Kwedho. Clans include Kothidha (families of Onyango, Tala, and Miego), Kalanya (Lanya Kwedho's wife), Katuma (Kwedho's wife, also called Jokoduongo), Kanyabala (Bala son of Kwedho), Kotieno (Otieno son of Kwedho), Abuor (wife of Nguju), and Kanyango (named after Anyango, wife of Nguju). Kabala and Kotieno together with Katuma are called Jokakdhungu."
      },
      {
        "name": "Kanyamwa",
        "description": "Joka Jok group. Wanjare killed his father accidentally and fled to Gusii country. Chwanya Junior had two sons: Ochieng and Onyango Rabala. Onyango Rabala was an illegitimate child, nicknamed 'Rabala' meaning warrior. Onyango's wives included Anyango Dhiaga (Nyarmwa), Akumu (mother of Owiti/Bwoch), and Nyagone (mother of Adem). Sub-clans from Maroka's sons: Kabonyo, Kwandiku, Kayambo, Kwamo. From family of Obunga Osewe: Kajwang', Kadwet, Kochieng', and Kamungu from family of Ologi."
      },
      {
        "name": "Kabwoch",
        "description": "Joka Jok folks. Bwoch (Owiti) was son of Onyango Rabala. As a young man, Owiti refused to marry and was called a eunuch ('Ng'ama Bwoch' in Dholuo). His descendants are known as Jo-Kabuoch."
      },
      {
        "name": "Kabondo",
        "description": "No specific details provided in the source, but Kabondo is one of the clans in Homabay."
      }
    ]
  }
  